# DS3000 Day 1

Sep 10, 2024

Admin
- Modules to install today `pip install collections seaborn numpy pandas` (you may not *need* to do all these, but why not?)
or `pip3 install collections seaborn numpy pandas`
  - If you don't have python and a way to edit jupyter notebooks, now's the time!
- Homework 1 due next Tues, Sep 17 before midnight

Push-Up Tracker
- Section 04: 1
- Section 08: 1

Content
- numpy & arrays
- pandas
    - series
    - dataframe

### Can you call a key from a dictionary based on a value?

Yes! There are a couple ways, but perhaps most simply, make use of `list()`, `.keys()`, `.values()`, and `.index()` and you can do it in one line (could also break this up into parts):

In [279]:
dict_a = {'first': 10, 'second': ["a", "list"], 'third': True}

# for those who may need a second to process the below:
# take the keys of dict_a and make them into a list "list(dict_a.keys())"
# take the values of dict_a and make them into a list "list(dict_a.values())"
# get the index of the value that corresponds to True ".index(True)"
# use square brackets to get the key corresponding to that index
list(dict_a.keys())[list(dict_a.values()).index(True)]

'third'

### Question from previous class: Is there a way to change the name of the keys in a dictionary?

Yes, there is a way. We can do it in one line of code, lets see an example:

In [280]:
dictionary = { 1: 'one', 2:'two', 3:'three'}
# This line will change the name of the key
dictionary['ONE'] = dictionary.pop(1)
dictionary

{2: 'two', 3: 'three', 'ONE': 'one'}

### Question from previous class: You can initialize an empty list, can you initialize an empty dictionary?

Yes! In fact, let's use it to create an example function to remind ourselves where we left off:

In [281]:
# this module allows you to initialize an empty dictionary
from collections import defaultdict

# another example function
def create_dict(featurenames, features):
    """ creates a dictionary with keys and values corresponding to the inputs

    Args:
        featurenames (list): a list of strings that will serve as the keys to the dictionary
        features (list): a list of values (any type) that will serve as the values of the dictionary

    Returns:
        dict (dictionary): the dictionary
    """

    # create an empty dictionary that will take lists as values
    dict = defaultdict(list)

    try:
        for i in range(len(featurenames)):
            # for each feature name, create a key-value pair in the dictionary
            dict[str(featurenames[i])] = features[i]

            # if age is a feature, create a logical column for an age 30 cut-off
            if featurenames[i] == "age":
                dict["old"] = [i > 30 for i in features[i]]

    except:
        # if something doesn't work above, let us know
        print("Failure to create dictionary; check inputs")

    return dict

In [282]:
test = ["bloodtype", "age", "height"]
vals = [["A", "B", "AB", "AB+"], [28, 31, 16, 88], [180, 194, 136, 178]]

create_dict(test, vals)

defaultdict(list,
            {'bloodtype': ['A', 'B', 'AB', 'AB+'],
             'age': [28, 31, 16, 88],
             'old': [False, True, False, True],
             'height': [180, 194, 136, 178]})

# PRACTICE PROBLEM FROM DAY 0

The Standard Creepiness Rule states that you shouldn't date anyone younger than $\frac{Your Age}{2} + 7$:

![dating](https://imgs.xkcd.com/comics/dating_pools.png)

Spend 5-10 minutes writing a function that takes as input a person's age, and outputs the sentence: `"You can date people at least {result} years old."` Where `{result}` is the result of calculating the lower bound of the SRC.

Then, define a variable `neighbor_age = int(input())` and pass it to your function after your neighbor enters their age.

**note 1**: we are using `int(input())` because by default `input()` takes only strings and we are going to be passing our function an integer. (This will be helpful on Part 2 of the HW!)

**note 2**: the solutions to this are in `Day0_BreakSolution` on Canvas.

# Representing data as arrays (or, matrices, if you prefer, though "array" is more general)
Its often a convenient analogy to consider a dataset as a big table.  A dataset describes the **features** of a collection of **samples**:
- each row represents a sample (or, observation)
    - e.g. a penguin
- each column represents a feature (or, variable)
    - e.g. how heavy the penguins are
- the intersection of a row and column contains the feature of the sample
    - e.g. how heavy a particular penguin is
    
<img src="https://imgur.com/orZWHly.png" width=300 />

In [283]:
# (we'll cover this code later, for now I just want us all to
# look at a dataset together)
import seaborn as sns

# data_source ='https://github.com/mwaskom/seaborn-data/blob/master/penguins.csv'
df_penguin = sns.load_dataset('penguins')
df_penguin.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

Some important things:

-> Whenever you want to show let say first 5 entries of any dataset, `head()` does that for you. **(default)**

-> You can specify the number of rows in the head argument to print those. So for example if you want to print first 30 rows, just say `head(30)` :)

Lets see an exaample:

In [284]:
import seaborn as sns

data_source= 'https://github.com/mwaskom/seaborn-data/blob/master/penguins.csv'
df_penguin = sns.load_dataset('penguins')
df_penguin.head(30)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,Male
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,Female
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,Male
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN
10,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN
11,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN
12,Adelie,Torgersen,41.1,17.6,182.0,3200.0,Female
13,Adelie,Torgersen,38.6,21.2,191.0,3800.0,Male
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,Male
15,Adelie,Torgersen,36.6,17.8,185.0,3700.0,Female
16,Adelie,Torgersen,38.7,19.0,195.0,3450.0,Female
17,Adelie,Torgersen,42.5,20.7,197.0,4500.0,Male
18,Adelie,Torgersen,34.4,18.4,184.0,3325.0,Female
19,Adelie,Torgersen,46.0,21.5,194.0,4200.0,Male
20,Adelie,Biscoe,37.8,18.3,174.0,3400.0,Female
21,Adelie,Biscoe,37.7,18.7,180.0,3600.0,Male
22,Adelie,Biscoe,35.9,19.2,189.0,3800.0,Female
23,Adelie,Biscoe,38.2,18.1,185.0,3950.0,Male
24,Adelie,Biscoe,38.8,17.2,180.0,3800.0,Male
25,Adelie,Biscoe,35.3,18.9,187.0,3800.0,Female
26,Adelie,Biscoe,40.6,18.6,183.0,3550.0,Male
27,Adelie,Biscoe,40.5,17.9,187.0,3200.0,Female
28,Adelie,Biscoe,37.9,18.6,172.0,3150.0,Female
29,Adelie,Biscoe,40.5,18.9,180.0,3950.0,Male

Why represent data in 2d arrays?
- many datasets well encapsulated as a 2d array with
    - different rows used for samples
    - different col used feature
- **Arrays (matrices) are natural math objects in linear algebra, probability and statistics all of which underpin machine learning.**

## Rows vs Columns
<img src="https://learnenglishfunway.com/wp-content/uploads/2021/07/Row-vs-Column.jpg" width=700 />

## **NumPy** (**Numerical Python**) Library
* First appeared in 2006 and is the **preferred Python array implementation**.
* High-performance, richly functional **_n_-dimensional array** type called **`ndarray`**.
* **Written in C** and **up to 100 times faster than lists**.
* Critical in big-data processing, AI applications and much more.
* According to `libraries.io`, **over 450 Python libraries depend on NumPy**.
* Many popular data science libraries such as Pandas, SciPy (Scientific Python) and Keras (for deep learning) are built on or depend on NumPy.

Big Question:
```
What is an array/matrix?  (and how is different than a list or list of lists?)
```

| Array                                 | List (Python: Dynamic Array)                         |
|---------------------------------------|------------------------------------------------------|
| Size is static (contiguous memory)    | Size can be modified quickly (non-contiguous memory) |
| Quick to compute (esp Linear Algebra) | Slower to compute (and clumsy looking code)          |
| contains 1 datatype (numeric)         | may contain many data types (need not be numeric)    |

### Initializing arrays:
- 1d from list / tuple
- 2d from list / tuple

In [285]:
import numpy as np

# x is a 1d array (3)
x = np.array((1, 2, 3))
x

array([1, 2, 3])

In [286]:
# y is a 2d array (2, 3)
y = np.array([[1, 2, 3],
              [4, 5, 6]])
y

array([[1, 2, 3],
       [4, 5, 6]])

### Building some special matrices
- zeros
- ones
- full
- identity


<img src="https://learnenglishfunway.com/wp-content/uploads/2021/07/Row-vs-Column.jpg" width=200 />

#### Convention: Rows First!
- we describe array shape as `(n_rows, n_cols)`
- we index into an array as `x[row_idx, col_idx]`

In [287]:
# shape = (n_rows, n_cols)
# shape = (height, width)
# .zeros gives an array of all zeros
z = np.zeros((5, 2)) # tall array
z

array([[0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

In [288]:
# .ones gives an array of all ones
one_array = np.ones((2, 5), dtype=int)
one_array

array([[1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

In [289]:
# can use .full to create an array of all fill_value
# np.full(shape=(2,5), fill_value=2)
two_array = np.full(shape=(2, 5), fill_value=2.0)
two_array

array([[2., 2., 2., 2., 2.],
       [2., 2., 2., 2., 2.]])

In [290]:
# identity matrix
# 1's on the diagonal, 0s elsewhere
np.eye(3)

# You can make a 2x2 identity matrix by specifying 2 in the eye parameter. Hence
# you can make 7x7 identifty matrix and so on %% [markdown] ## Arrays which
# change: - `.arange()` - `.linspace()` - `.geomspace()` - `.logspace()` %%
np.eye(7)

array([[1., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 1.]])

## Arrays which change:
- `.arange()`
- `.linspace()`
- `.geomspace()`
- `.logspace()`

In [291]:
# note: not "arrange", but rather "(a)rray (range)"
# np.arange(start (inclusive), stop (exclusive), step)
np.arange(0, 10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [292]:
#How would i make an array with all even numbers from 1-10?
np.arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [293]:
# linearly spaced values np.linspace(start (inclusive), stop (inclusive), size)
np.linspace(0, 1, 7)

array([0.        , 0.16666667, 0.33333333, 0.5       , 0.66666667,
       0.83333333, 1.        ])

In [294]:
# geom spaced values np.geomspace(start (inclusive), stop (inclusive), size)
# Basically, if you want evenly spaced numbers on a log scale between start and stop values
np.geomspace(1, 27, 4)

array([ 1.,  3.,  9., 27.])

In [295]:
# log spaced value np.logspace(start_exp, stop_exp, size)
# start = 10^start_exp, stop = 10^stop_exp
np.logspace(0, 2, 3)

array([  1.,  10., 100.])

Can you get log spaced values for a base other than 10?

In [296]:
# what about a different base? e-asy!
import math
np.logspace(0, 2, 3, base=math.exp(1))

array([1.        , 2.71828183, 7.3890561 ])

### Array Attributes
- shape
- size
- ndim

Numpy can build arrays out of many different number types (bool, int, float).  ([see also](https://numpy.org/doc/stable/user/basics.types.html#:~:text=There%20are%205%20basic%20numerical,point%20(float)%20and%20complex.&text=NumPy%20knows%20that%20int%20refers,int_%20%2C%20bool%20means%20np.))
- dtype
    - astype
- nbytes

In [297]:
x = np.array([[1, 2, 3],
              [4, 5, 6]])

In [298]:
# whether you see int32 or int64 depends on the bit size; it should not truly matter
x.dtype

dtype('int64')

In [299]:
# ndim is the (n)umber of (dim)ensions
x.ndim

2

In [300]:
# shape gives the values of the dimensions
x.shape

(2, 3)

In [301]:
# size is total number of elements
x.size

6

In [302]:
# return the total bytes consumed by the elements of the array
x.nbytes

48

In [303]:
# converting the type of an array can help lower the memory demands
# https://numpy.org/doc/stable/user/basics.types.html
x_low_mem = np.array([[1, 2, 3],
                      [4, 5, 6]], np.uint8)
x_low_mem.nbytes

6

## Manipulating array shape

### Diagonal

The diagonal of each array is shaded below, the unshaded elements are not on the diagonal of the matrix:

$$ \begin{bmatrix}
\blacksquare & \square & \square\\
\square & \blacksquare & \square\\
\square & \square & \blacksquare\\
\square & \square & \square\\
\end{bmatrix}
\hspace{2cm}
\begin{bmatrix}
\blacksquare & \square & \square & \square & \square\\
\square & \blacksquare & \square& \square & \square\\
\square & \square & \blacksquare& \square & \square\end{bmatrix}
\hspace{2cm}
\begin{bmatrix}
\blacksquare & \square & \square\\
\square & \blacksquare & \square\\
\square & \square & \blacksquare
\end{bmatrix}
$$

### Numpy methods
- transpose
- `.reshape()`
    - order of reshape (row or column first?)

In [304]:
x = np.array([[1, 2, 3],
              [4, 5, 6]])
x

array([[1, 2, 3],
       [4, 5, 6]])

In [305]:
# transpose (.T): flip across the diagonal
y = x.T
y

array([[1, 4],
       [2, 5],
       [3, 6]])

In [306]:
# reshape allows us to change shape of matrix by defining the dimensions
x.reshape((1, 6))

array([[1, 2, 3, 4, 5, 6]])

In [307]:
# (new matrix must have same total number of elements)
# x.reshape((1, 8))

In [308]:
z = np.arange(0, 12)
z

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [309]:
z.reshape((3, 4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [310]:
# -1 may be used at most once in the shape argument; it is used to tell python to
# choose the value to ensure output array has same number of elements
z.reshape((3, -1))

# Also we can have -1 as rows so:
# z.reshape((-1,2))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [311]:
# be mindful that -1 can be replaced by some integer to keep same number of elements in array
# but you need to make sure that the multiplication works!
# z.reshape((5, -1))

In [312]:
# we can fill the array across the rows first (order='C'), which is the default
z.reshape((3, 4), order='C')

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [313]:
# or down columns first (order='F')
z.reshape((3, 4), order='F')

array([[ 0,  3,  6,  9],
       [ 1,  4,  7, 10],
       [ 2,  5,  8, 11]])

## Array Indexing (slicing)

You can index arrays, everything we've previously shown about `start:stop:step` indexing works for arrays too!

In [314]:
x = np.arange(11)
x

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [315]:
x[5]

5

In [316]:
x[2:6]

array([2, 3, 4, 5])

In [317]:
x[-3:]

array([ 8,  9, 10])

<img src="https://hypefury.com/wp-content/uploads/2023/02/what-gif.gif" width=300 />

<img src="https://media.tenor.com/8KXX8NfhfmAAAAAM/beaker-muppets.gif" width=300 />

Just to recap, if you are feeling lazy, and just want the last 3 digits in an array, pass -3 and `:` tells python that please give me last three elements from the last!

In [318]:
x[:5]
# Here `:` means start from the start!

array([0, 1, 2, 3, 4])

A two dimensional array requires two indices to get a value: `x[row_idx, col_idx]`

(Just like our convention for rows first in shape, the row index comes first as we index into the array)

In [319]:
x = np.arange(20).reshape((4, 5))
x
# You can make the array order down columns first (order='F') so for that :
#x = np.arange(20).reshape((4, 5),order='F)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [320]:
# row_idx=1 (second row since python starts counting at 0)
# col_idx=2 (third row since python starts counting at 0)
x[1, 2]

7

In [321]:
# we can start:stop:step slice either index

# get a slice of rows and a constant column
x[0:2, 2]

# Lets understand this-> [0:2] means please give me the
# first and second row of the array so
# [ 0,  1,  2,  3,  4],
# [ 5,  6,  7,  8,  9]
# and then 2 means please provide me the numbers from the second coloumn so that
# will be 2 and 7 %% get a slice of columns and a constant row

array([2, 7])

In [322]:
# get a slice of columns and a constant row
x[2, 0:2]

array([10, 11])

## Super useful slice syntax on arrays:
(so useful it deserves its own title)

In [323]:
# by default, the slice indexing chooses start:stop to give the entire object
x = np.array([1, 2, 3])
x[:]

array([1, 2, 3])

In [324]:
# we can use this to get an entire rows or columns as needed
x = np.arange(20).reshape((4, 5))
x

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [325]:
# get the first column
x[:, 0]

array([ 0,  5, 10, 15])

In [326]:
# get the second row
x[1, :]

array([5, 6, 7, 8, 9])

In [327]:
# get the last two columns
x[:, -2:]

array([[ 3,  4],
       [ 8,  9],
       [13, 14],
       [18, 19]])


<img src="https://media.tenor.com/9VuG1d2QOOQAAAAM/oh-my-god-its-happening.gif" width=300 />

### Computing stats on an array
- `.sum()`
- `.min()`
- `.max()`
- `.mean()`
- `.std()`
    - standard deviation
- `.var()`
    - variance
- `.argmin()`
    - index of item which is smallest
- `.argmax()`
    - index of item which is largest

In [328]:
x = np.array([4, 3, 5, 4])
x

array([4, 3, 5, 4])

In [329]:
# get index of smallest item
# (smallest item, 3, is at index 1)
x.argmin()

1

In [330]:
y = np.arange(100, 112).reshape((3, 4))
y

array([[100, 101, 102, 103],
       [104, 105, 106, 107],
       [108, 109, 110, 111]])

In [331]:
y.sum(), y.min(), y.max(), y.mean(), y.std(), y.var()

(1266, 100, 111, 105.5, 3.452052529534663, 11.916666666666666)

In [332]:
# axis: which of the shape parameters should I operate on?
# shape = (shape0, shape1)

# axis=0 averages across different rows to give the column average
y.mean(axis=0)

array([104., 105., 106., 107.])

In [333]:
# axis=1 averages across different columns to give the row average
y.mean(axis=1)

array([101.5, 105.5, 109.5])

**So in a nutshell, when we say axis=0, we mean get stuff from the coloumns and axis =1, to get stuff from rows!**

In [334]:
# axis is an accepted keyword of all methods listed above
y.min(axis=1)

array([100, 104, 108])

In [335]:
y.min(axis=0)

array([100, 101, 102, 103])

## Why are we doing this again?

<img src="https://imgur.com/orZWHly.png" width=300 />

In [336]:
import seaborn as sns

# data source='https://github.com/mwaskom/seaborn-data/blob/master/penguins.csv'
df_penguin = sns.load_dataset('penguins')
df_penguin.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

## Array Operations:
- array and a scalar:
    - apply operation to every element of array
- array and array:
    - apply operation to corresponding elements of arrays (requires shape or [special](https://numpy.org/doc/stable/user/basics.broadcasting.html) structure)

In [337]:
y1 = np.arange(12).reshape((3, 4))
y1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [338]:
y1 + 3

array([[ 3,  4,  5,  6],
       [ 7,  8,  9, 10],
       [11, 12, 13, 14]])

In [339]:
y1 * 10

array([[  0,  10,  20,  30],
       [ 40,  50,  60,  70],
       [ 80,  90, 100, 110]])

In [340]:
y1 ** 2

array([[  0,   1,   4,   9],
       [ 16,  25,  36,  49],
       [ 64,  81, 100, 121]])

In [341]:
# array and array arithmetic
y2 = np.arange(100, 112).reshape((3, 4))
y2

array([[100, 101, 102, 103],
       [104, 105, 106, 107],
       [108, 109, 110, 111]])

In [342]:
# array and array arithmetic applies operation to corresponding items in arrays
y1 + y2

array([[100, 102, 104, 106],
       [108, 110, 112, 114],
       [116, 118, 120, 122]])

In [343]:
y1 * y2

array([[   0,  101,  204,  309],
       [ 416,  525,  636,  749],
       [ 864,  981, 1100, 1221]])

In [344]:
y1

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [345]:
# (++) adding a constant row (x) to all rows of a matrix (y1)
# more details here: https://numpy.org/doc/stable/user/basics.broadcasting.html
x = np.array([1000, 2000, 3000, 4000])
y1 + x

array([[1000, 2001, 3002, 4003],
       [1004, 2005, 3006, 4007],
       [1008, 2009, 3010, 4011]])

# If I haven't given it yet, it's 5-minute Break Time! Ask me questions about NumPy, or go get water, or stretch, or just veg out for a few minutes.

# Pandas


*   My nickname is Panda (Look at my cute picture)

<img src="https://images.ctfassets.net/rt5zmd3ipxai/25pHfG94sGlRALOqbRvSxl/9f591d8263607fdf923b962cbfcde2a9/NVA-panda.jpg" width=700 />


Pandas is a python module which stores data.  

### If we already have `np.array()`, why do we need pandas?
- pandas supports non numeric data (strings for categorical data, for example)
- pandas supports reading / storing data from more formats
    - csv (spreadsheets)
- pandas more elegantly deals with missing data
- pandas handles indexing woes

You could do almost everything pandas does with numpy arrays ... but it would be much more difficult to accomplish.

### Pandas has two essential objects:
- **dataframe**
    - 2 dimensional data structure
    - you've already seen one today!  (we replicate below)
- **series (vectors)**
    - 1 dimensional data structure, each item associated with some index
    - you could store the weight of all the penguins as a series
        - (all samples of one feature)
    - you could store the weight, bill size, sex, island, etc for a single penguin as a series
        - (all features for one sample)

In [346]:
import seaborn as sns

# df stands for dataframe.  df_penguin is a dataframe of penguin data
df_penguin = sns.load_dataset('penguins')
df_penguin.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

In [347]:
# the table above is a dataframe
type(df_penguin)

pandas.core.frame.DataFrame

## Pandas Series
### building:
- building: default index
- building: custom index
- building: from a dict

In [348]:
# each row, or column is a series object
# this represents first row of dataframe
penguin0_series = df_penguin.iloc[0, :]
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
Name: 0, dtype: object

Pandas series contain a sequence of labelled data elements:
- penguin0's `species` is `Adelie`
- penguin0's `island` is `Torgersen`
- penguin0's `bill_length_mm` is `39.1` ...
- penguin0's `<index-name>` is `<corresponding-value>`

A series is quite similar to a dictionary ...

In [349]:
penguin0_dict = {'species': 'Adelie',
 'island': 'Torgersen',
 'bill_length_mm': 39.1,
 'bill_depth_mm': 18.7,
 'flipper_length_mm': 181.0,
 'body_mass_g': 3750.0,
 'sex': 'Male'}

In [350]:
import pandas as pd

# build a series from dict
penguin0_series = pd.Series(penguin0_dict)
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
dtype: object

In [351]:
# you can also pass two corresponding lists / tuples
index = ['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex']
values = ['Adelie', 'Torgersen', 39.1, 18.7, 181.0, 3750.0, 'Male']

penguin0_series = pd.Series(values, index=index)
penguin0_series

species                 Adelie
island               Torgersen
bill_length_mm            39.1
bill_depth_mm             18.7
flipper_length_mm        181.0
body_mass_g             3750.0
sex                       Male
dtype: object

In [352]:
# sometimes your data has no meaningful index
# pandas will default to indexing things with integers
ice_cream_flavors = 'vanilla', 'chocolate', 'cherry garcia', 'oatmeal'
pd.Series(ice_cream_flavors)

0          vanilla
1        chocolate
2    cherry garcia
3          oatmeal
dtype: object

In [353]:
# you can access values via .values
penguin0_series.values

array(['Adelie', 'Torgersen', 39.1, 18.7, 181.0, 3750.0, 'Male'],
      dtype=object)

In [354]:
# you can access index via .index
penguin0_series.index

Index(['species', 'island', 'bill_length_mm', 'bill_depth_mm',
       'flipper_length_mm', 'body_mass_g', 'sex'],
      dtype='object')

### Using Series (hey, don't they look a little like dictionaries?)
- casting dictionaries to series
- accessing custom index:
    - by name: `series.loc[name]`
    - by position: `series.iloc[idx]`
- iterating: keys, items, iteritems (much like dict)
- deleting an entry

In [355]:
dict_fav_num = {'mohit':  17, 'qi': 7, 'lynne': 3, 'tamrat': 1}
series_fav_num = pd.Series(dict_fav_num)
series_fav_num

mohit     17
qi         7
lynne      3
tamrat     1
dtype: int64

In [356]:
# lookup value associated with index='eric'
#series_fav_num['eric']

In [357]:
# another way to lookup value associated with index='eric'
#series_fav_num.loc['eric']

In [358]:
# return the value in position 2 (the third position, from top)
series_fav_num.iloc[1]

7

In [359]:
# each of these access methods can also set the value
series_fav_num.iloc[2] = 1000
series_fav_num

mohit       17
qi           7
lynne     1000
tamrat       1
dtype: int64

In [360]:
for idx in series_fav_num.index:
    print(idx)

mohit
qi
lynne
tamrat

In [361]:
# check membership of item in index
'mohit' in series_fav_num.index

True

In [362]:
'alice' in series_fav_num.index

False

In [363]:
# iterating through values
for val in series_fav_num.values:
    print(val)

17
7
1000
1

In [364]:
# iterating through index (just a like dict!)
# .keys() produces same thing as .index
for key in series_fav_num.keys():
    print(key)

mohit
qi
lynne
tamrat

In [365]:
# iterating through index, value pairs (just like dict!)
for key, val in series_fav_num.items():
    print(key, val)

mohit 17
qi 7
lynne 1000
tamrat 1

In [366]:
# removing a pair by its corresponding index (just like dict!)
del series_fav_num['mohit']

In [367]:
series_fav_num

qi           7
lynne     1000
tamrat       1
dtype: int64

### Describing a `pd.Series`

Just like numpy arrays:
- `Series.argmin()`
    - which index has smallest value
    - pandas gives the row number, not the index
- `Series.argmax()`
    - which index has largest value
    - pandas gives the row number, not the index
- `Series.mean()`
- `Series.min()`
- `Series.max()`
- `Series.std()`
- `Series.var()`

New to pandas:
- `Series.count()`
    - number of item pairs in series
- `Series.describe()`
    - summary statistics

In [368]:
# number of entries (rows)
series_fav_num.count()

3

# why do things indiviually, when we can just use the describe function!
# That sounds suspicious
<img src="https://media4.giphy.com/media/lxfXcVFaE42By/giphy.gif?cid=6c09b952maa6322c0k5ptstqtnyfh17567xj6xpjyc6nsoae&ep=v1_internal_gif_by_id&rid=giphy.gif&ct=g" width=700 />

In [369]:
# other descriptors/summary statistics

series_fav_num.describe()

count       3.000000
mean      336.000000
std       575.048694
min         1.000000
25%         4.000000
50%         7.000000
75%       503.500000
max      1000.000000
dtype: float64

## Pandas: DataFrame

Remember:
- `Series`:  1d data object
- `DataFrame`: 2d data object

`DataFrame`s represent two-dimensional data, for example, grades:

|           | Quiz 0 | Quiz 1 | Quiz 2 |
|-----------|--------|--------|--------|
| Student 0 | 80     | 90     | 50     |
| Student 1 | 87     | 92     | 80     |

Each column or row above could be considered a `Series` object (as we'll see later, we can indeed extract a single row or column of a dataframe as a `Series` object).

In [370]:
import pandas as pd
import numpy as np

quiz_array = np.array([[80, 90, 50],
                 [87, 92, 80]])

df_quiz = pd.DataFrame(quiz_array,
                       columns=('quiz0', 'quiz1', 'quiz2'),
                       index=('student0', 'student1'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [371]:
# we construct a dataframe as a dictionary
# keys of the dictionary are columns of dataframe
# values are lists (or tuples) of the values in each column
quiz_dict = {'quiz0': [80, 87],
            'quiz1': [90, 92],
            'quiz2': [50, 80]}
pd.DataFrame(quiz_dict, index=('student0', 'student1'))

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [372]:
# another way to construct, this time the transpose
quiz_dict2 = {'student0': [80, 90, 50],
             'student1': [87, 92, 80]}
pd.DataFrame(quiz_dict2, index=('quiz0', 'quiz1', 'quiz2'))

       student0  student1
quiz0        80        87
quiz1        90        92
quiz2        50        80

In [373]:
# could also use .transpose() or even .T
df_quiz.transpose()
# df_quiz.T

       student0  student1
quiz0        80        87
quiz1        90        92
quiz2        50        80

In [374]:
# we can also add the column or index names after creation
df_quiz = pd.DataFrame(quiz_array)
df_quiz

    0   1   2
0  80  90  50
1  87  92  80

In [375]:
df_quiz.columns = ['quiz0', 'quiz1', 'quiz2']
df_quiz.index = ('student0', 'student1')
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

### Describing a `pd.DataFrame`

Similar to Series (for now), but with a couple differences:
- `DataFrame.iloc[].idxmin()` or `DataFrame.loc[].idxmin()`
    - note that this does not work on the DataFrame itself, but on specified series/rows
    - which index has smallest value
    - pandas gives the row number, not the index
- `DataFrame.iloc[].idxmax()` or `DataFrame.loc[].idxmax()`
    - note that this does not work on the DataFrame itself, but on specified series/rows
    - which index has largest value
    - pandas gives the row number, not the index
- `DataFrame.mean()`
- `DataFrame.min()`
- `DataFrame.max()`
- `DataFrame.std()`
- `DataFrame.var()`

New to pandas:
- `DataFrame.count()`
    - number of item pairs in series
- `DataFrame.describe()`
    - summary statistics

In [376]:
# by default, each method applies operation to entire column of data
# note that there may be some complaining from python if not all the columns are numeric
df_quiz.mean()

quiz0    83.5
quiz1    91.0
quiz2    65.0
dtype: float64

In [377]:
# we can also pass axis parameter to specify if operation should be applied to row or column
# !remember!
# axis=0 -> apply operation across all rows and returns operation output per col
# axis=1 -> apply operation across all cols and returns operation output per row
df_quiz.mean(axis=1)

student0    73.333333
student1    86.333333
dtype: float64

In [378]:
# describe only works on columns
df_quiz.describe()

           quiz0      quiz1      quiz2
count   2.000000   2.000000   2.000000
mean   83.500000  91.000000  65.000000
std     4.949747   1.414214  21.213203
min    80.000000  90.000000  50.000000
25%    81.750000  90.500000  57.500000
50%    83.500000  91.000000  65.000000
75%    85.250000  91.500000  72.500000
max    87.000000  92.000000  80.000000

## Indexing / Accessing a DataFrame
- indexing:
    - `.loc[]` indexing by name of row or column
    - `.iloc[]` indexing by position integer (0, 1, 2, 3, 4 ...)
    & slicing & subsets
- using `:` to get full rows or columns
- single cell's contents: `at`, `iat` & slicing

In [379]:
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [380]:
# indexing data by "name"
# remember: rows first, then columns ...
# 1st entry describes which row ('student0')
# 2nd entry describes which col ('quiz0')

df_quiz.loc['student0', 'quiz0']

80

In [381]:
# index data by position
# 1st entry describes which row.  0 -> the 1st (topmost) row
# 2nd entry describes which col.  2 -> the 3rd (from the left) col
df_quiz.iloc[0, 2]

50

In [382]:
# you can use same slicing syntaxes on both .loc and .iloc
# 1st row, last col
df_quiz.iloc[0, -1]

50

In [383]:
# all rows, only the second col
df_quiz.iloc[:, 1]

student0    90
student1    92
Name: quiz1, dtype: int64

In [384]:
# all rows, only quiz0
df_quiz.loc[:, 'quiz0']

student0    80
student1    87
Name: quiz0, dtype: int64

In [385]:
# slicing with named cols and rows
# you can get a range, by name of row/col
# note: this includes both start and stop columns
df_quiz.loc['student0', 'quiz0':'quiz2' ]

quiz0    80
quiz1    90
quiz2    50
Name: student0, dtype: int64

In [386]:
# watch out:
# when you get ranges indexed by position: include start idx, exclude stop idx)
df_quiz.iloc[0, 0:2 ]

quiz0    80
quiz1    90
Name: student0, dtype: int64

In [387]:
# if you access directly into dataframe, it will assume you're looking for a column
# (below is equivilent to df_quiz.loc[:, 'quiz0'])
df_quiz['quiz0']

student0    80
student1    87
Name: quiz0, dtype: int64

loc gets rows (and/or columns) with particular labels.

iloc gets rows (and/or columns) at integer locations.

Additionally, `s.loc[0:2]`  # rows at index labels between 0 and 1 (inclusive) so this means 0, 1 and 2
`s.iloc[0:2]`  # rows at index labels between 0 and 1 (exclusive), so that means 0th and 1st


<img src='https://media1.giphy.com/media/l2R01mSIsazqNQ7ks/giphy.gif?cid=6c09b952x9z29ab4af9xpluk4vjxwzu6tm0nacgw1qxi8e5f&ep=v1_gifs_search&rid=giphy.gif&ct=g' width=700 />

## Modifying a DataFrame
- updating values: single cell
- adding a new column
- `pd.DataFrame.append()` and `pd.DataFrame.concat()`
    - adds a single row to a dataframe
    - `.append()` is deprecated, and may not work depending on your version of Python! Has been replaced with `.concat()` (which we use here)

In [388]:
# setting single entry in dataframe
df_quiz.loc['student0', 'quiz1'] = 123
df_quiz

          quiz0  quiz1  quiz2
student0     80    123     50
student1     87     92     80

In [389]:
# adding a new column (which student got which grade?)
# notice data frames can include columns of multiple types!
df_quiz['overall grade'] = 'a', 'b'
df_quiz

          quiz0  quiz1  quiz2 overall grade
student0     80    123     50             a
student1     87     92     80             b

In [390]:
# delete a column
del df_quiz['overall grade']
df_quiz

# There is another way of deleteing a coloumn which is by using the drop()
# function df.drop('column_name', axis=1)

          quiz0  quiz1  quiz2
student0     80    123     50
student1     87     92     80

In [391]:
# adding a column (next 2 cells) more error robust way of handling indexing
# by explicitly labelling the index we're sure to match more explicitly
s_overgrade = pd.Series({'student1': 'b-',
                         #'student0': 'a+',
                        'student2': 'f (no quizzes taken)'})
s_overgrade

student1                      b-
student2    f (no quizzes taken)
dtype: object

In [392]:
# notice how pandas helps us out in aligning our new column with proper row
# (and avoids including student2)
df_quiz['overall grade'] = s_overgrade
df_quiz

          quiz0  quiz1  quiz2 overall grade
student0     80    123     50           NaN
student1     87     92     80            b-

In [393]:
# how to 'drop' a row (returns a dataframe with row removed)
df_quiz_short = df_quiz.drop('student0')
df_quiz_short

          quiz0  quiz1  quiz2 overall grade
student1     87     92     80            b-

In [394]:
# rebuild df_quiz
quiz_dict = {'quiz0': [80, 87],
            'quiz1': [90, 92],
            'quiz2': [50, 80]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [395]:
# notice: name of series ends up on index of dataframe
# notice: order of items in series doesnt matter, they're aligned by index
s_student3 = pd.Series({'quiz1': 90,
                        'quiz2': 100,
                        'quiz0': 95},
                      name='student3')
s_student3

quiz1     90
quiz2    100
quiz0     95
Name: student3, dtype: int64

In [396]:
# Do you think that name thing will work for this example:
quiz_dict = {'quiz0': [80, 87],
            'quiz1': [90, 92],
            'quiz2': [50, 80]}
#df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1'),name="Student")
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

pd.series have some more parameters : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

pd.dataframe: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html

In [397]:
# add new row to dataframe
pd.concat([df_quiz, s_student3.to_frame().T])

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student3     95     90    100

In [398]:
# also notice: .concat() returns a copy of df_quiz, it isn't modified above
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80

In [399]:
# thus, must overwrite:
df_quiz = pd.concat([df_quiz, s_student3.to_frame().T])
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student3     95     90    100

In [400]:
# adding a column that is a function of other columns:
df_quiz['average'] = (df_quiz['quiz0'] + df_quiz.quiz1 + df_quiz.quiz2)/3
df_quiz

          quiz0  quiz1  quiz2    average
student0     80     90     50  73.333333
student1     87     92     80  86.333333
student3     95     90    100  95.000000

In [401]:
df_quiz.average

student0    73.333333
student1    86.333333
student3    95.000000
Name: average, dtype: float64

In [402]:
df_quiz['quiz0']

student0    80
student1    87
student3    95
Name: quiz0, dtype: int64

### Operating on DataFrame & Series Objects

Your operators do what you'd expect them to:

In [403]:
df_quiz * 1000

          quiz0  quiz1   quiz2       average
student0  80000  90000   50000  73333.333333
student1  87000  92000   80000  86333.333333
student3  95000  90000  100000  95000.000000

In [404]:
# we can also use comparison operators (super helpful, see boolean indexing next)
df_quiz >= 85

          quiz0  quiz1  quiz2  average
student0  False   True  False    False
student1   True   True  False     True
student3   True   True   True     True

### Boolean Indexing into DataFrame

Sometimes we want to grab only the rows or columns which meet a particular condition.

"Get all students whose grade was higher than 85 on quiz 1"

In [405]:
quiz_dict = {'quiz0': [80, 87, 60, 30],
            'quiz1': [90, 92, 60, 23],
            'quiz2': [50, 80, 70, 64]}
df_quiz = pd.DataFrame(quiz_dict, index=('student0', 'student1', 'student2', 'student3'))
df_quiz

          quiz0  quiz1  quiz2
student0     80     90     50
student1     87     92     80
student2     60     60     70
student3     30     23     64

In [406]:
# quiz 2 is a series object which contains every index's quiz 2 grade
# one, verbose way:
s_quiz2 = df_quiz.loc[:, 'quiz2']
s_quiz2

student0    50
student1    80
student2    70
student3    64
Name: quiz2, dtype: int64

In [407]:
# easier way, but not as convenient for seeing what we're about to do
df_quiz.quiz2

student0    50
student1    80
student2    70
student3    64
Name: quiz2, dtype: int64

In [408]:
# boolean indexing: using a boolean series as index returns only those entries which are True
# notice that since student0 & student3's quiz1 grade wasn't > 70 they aren't
# included below.
df_quiz.loc[s_quiz2 >= 70, :]

          quiz0  quiz1  quiz2
student1     87     92     80
student2     60     60     70

In [409]:
# we can build more complex conditions using
# & (and operator)
# | (or operator)

# all students who got at least an 80 on quiz1 but scored less than 75 on quiz2
s_bool = (df_quiz.loc[:, 'quiz1'] >= 80) & (df_quiz.quiz2  < 75)
s_bool

student0     True
student1    False
student2    False
student3    False
dtype: bool

In [410]:
df_quiz.loc[s_bool, :]

          quiz0  quiz1  quiz2
student0     80     90     50

# Loading Data into Pandas

Data comes from many places:
- Web Scraping
- Application Program Interface (API)
- SQL
- local file:
    - csv
    - JSON
    - fixed width tables (HTML)
    
### Pandas functions which load data
| Mode | Description
| ------ | :------
| **`read_csv`** | Load comma seperated values data from a file or URL (other delimeters too!)
| **`read_xlsx`** | Read data in xls format (Mircosoft Excel)
| **`read-fwf`** | Read data in fixed-width column format (i.e., no delimiters such as tab-separated txt files)
| **`read_clipboard`** | Version of read_csv that reads data from the clipboard; useful for converting tables from web pages
| **`read_html`** | Read all tables contained in the given HTML document.
| **`read_json`** | Read data from a JSON (JavaScript Object Notation) string representation

## Reading CSV into Pandas
- read_csv
- index_col
- header

In [411]:
import pandas as pd
# note: file must be in same folder as jupyter notebook
pd.read_csv('day-1dataset.csv')

,Restaurant,Latitude,Longitude,Address,PlaceID,URL,AverageExposure,Stars,ZIP,Count,...,HED,Unemployment,HUne,Wealth,HWe,Attraction,Hotspot,Reviews,Amenities,Amenity_Count
0,61Sliders,61.149140,-149.878090,"7920 King St, Anchorage, AK 99518",-,/biz/61sliders-anchorage?osq=Restaurants,0.124478,3.6,99507,22,...,0,4.7,1,88485,0,1,0,1,Classy,1
1,907 Alehouse & Grill,61.148140,-149.863132,"8001 Old Seward Hwy, Anchorage, AK 99518, Unit...",ChIJsX90-NaZyFYRGJ_WD0iQlaA,/biz/907-alehouse-and-grill-anchorage?osq=Rest...,0.130601,3.4,99503,93,...,0,7.9,1,63338,0,0,1,135,Takes Reservations\nOffers Takeout\nNo Deliver...,22
2,907 Wingman,61.188415,-149.907983,"3505 Spenard Rd, Anchorage, AK 99503, United S...",ChIJ4-dvWd2XyFYR-dL2s0DiD_0,/biz/907-wingman-anchorage?osq=Restaurants,0.109058,4.1,99508,9,...,0,6.5,1,65430,0,1,1,110,Offers Delivery\nOffers Takeout\nNo Reservatio...,17
3,AK Alchemist,61.218773,-149.882808,"103 E 4th Ave, Anchorage, AK 99501, United States",ChIJt_B88yiWyFYRZQB7I68Jokk,/biz/ak-alchemist-anchorage?osq=Restaurants,0.164824,3.8,99501,58,...,0,7.2,1,61509,0,1,1,178,Offers Delivery\nOffers Takeout\nNo Reservatio...,3
4,Alaska Crepery,61.217756,-149.888169,"319 W 5th Ave, Anchorage, AK 99501, United States",ChIJC6dwVAyXyFYR0ZZMmzzULww,/biz/alaska-crepery-anchorage-2?osq=Restaurants,0.161754,4.5,99507,22,...,0,4.7,1,88485,0,1,1,164,Takes Reservations\nOffers Delivery\nOffers Ta...,16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
286,Yakishabu Sushi House,61.144031,-149.892769,"720 W Dimond Blvd, Anchorage, AK 99515, United...",ChIJMdQzoAOZyFYR1rEIFO_2Wyo,/biz/yakishabu-sushi-house-anchorage-4?osq=Res...,0.184925,3.9,99515,39,...,1,4.0,1,106755,1,0,0,32,"Offers Delivery\nOffers Takeout\nCasual, Trend...",9
287,Yamaya Seafood Restaurant,61.216698,-149.898625,"825 W 6th Ave, Anchorage, AK 99501, United States",ChIJVVN224C9yFYRmmjSJ1vPVj4,/biz/yamaya-seafood-restaurant-anchorage?osq=R...,0.123558,3.7,99501,58,...,0,7.2,1,61509,0,1,1,124,Takes Reservations\nOffers Takeout\nNo Deliver...,15
288,Yogo Delight,61.184160,-149.867577,"4007 Old Seward Hwy # 200, Anchorage, AK 99503...",ChIJT0w0d7yXyFYRcCATvyPkT6Y,/biz/yogo-delight-anchorage?osq=Restaurants,0.099800,4.4,99508,9,...,0,6.5,1,65430,0,1,0,116,Offers Takeout\nNo Reservations\nNo Delivery\n...,18
289,Zorba's Gyros,61.195857,-149.890254,"2700 Blueberry Rd, Anchorage, AK 99503, United...",ChIJI7cNe8WXyFYRuJw8-CPA5f4,/biz/zorbas-gyros-anchorage?osq=Restaurants,0.116808,4.4,99518,21,...,0,3.0,0,84045,0,1,1,80,Offers Takeout\nNo Reservations\nAccepts Credi...,11
290,Serrano's Mexican Grill,61.195468,-149.880141,"201 E Northern Lights Blvd, Anchorage, AK 9950...",ChIJH0A8uciXyFYRQvUedUNWEEU,/biz/serranos-mexican-grill-anchorage?osq=Rest...,0.141745,3.9,99577,13,...,1,3.5,1,111388,1,1,0,270,Offers Delivery\nOffers Takeout\nNo Reservatio...,20

In [412]:
# look at the first few rows (header)
gtky = pd.read_csv('day-1dataset.csv', index_col='Latitude')
gtky.head()

,Restaurant,Longitude,Address,PlaceID,URL,AverageExposure,Stars,ZIP,Count,White,...,HED,Unemployment,HUne,Wealth,HWe,Attraction,Hotspot,Reviews,Amenities,Amenity_Count
Latitude,,,,,,,,,,,,,,,,,,,,,
61.149140,61Sliders,-149.878090,"7920 King St, Anchorage, AK 99518",-,/biz/61sliders-anchorage?osq=Restaurants,0.124478,3.6,99507,22,20110,...,0,4.7,1,88485,0,1,0,1,Classy,1
61.148140,907 Alehouse & Grill,-149.863132,"8001 Old Seward Hwy, Anchorage, AK 99518, Unit...",ChIJsX90-NaZyFYRGJ_WD0iQlaA,/biz/907-alehouse-and-grill-anchorage?osq=Rest...,0.130601,3.4,99503,93,6167,...,0,7.9,1,63338,0,0,1,135,Takes Reservations\nOffers Takeout\nNo Deliver...,22
61.188415,907 Wingman,-149.907983,"3505 Spenard Rd, Anchorage, AK 99503, United S...",ChIJ4-dvWd2XyFYR-dL2s0DiD_0,/biz/907-wingman-anchorage?osq=Restaurants,0.109058,4.1,99508,9,15722,...,0,6.5,1,65430,0,1,1,110,Offers Delivery\nOffers Takeout\nNo Reservatio...,17
61.218773,AK Alchemist,-149.882808,"103 E 4th Ave, Anchorage, AK 99501, United States",ChIJt_B88yiWyFYRZQB7I68Jokk,/biz/ak-alchemist-anchorage?osq=Restaurants,0.164824,3.8,99501,58,9223,...,0,7.2,1,61509,0,1,1,178,Offers Delivery\nOffers Takeout\nNo Reservatio...,3
61.217756,Alaska Crepery,-149.888169,"319 W 5th Ave, Anchorage, AK 99501, United States",ChIJC6dwVAyXyFYR0ZZMmzzULww,/biz/alaska-crepery-anchorage-2?osq=Restaurants,0.161754,4.5,99507,22,20110,...,0,4.7,1,88485,0,1,1,164,Takes Reservations\nOffers Delivery\nOffers Ta...,16

In [413]:
# or the last few (tail)
gtky.tail()

,Restaurant,Longitude,Address,PlaceID,URL,AverageExposure,Stars,ZIP,Count,White,...,HED,Unemployment,HUne,Wealth,HWe,Attraction,Hotspot,Reviews,Amenities,Amenity_Count
Latitude,,,,,,,,,,,,,,,,,,,,,
61.144031,Yakishabu Sushi House,-149.892769,"720 W Dimond Blvd, Anchorage, AK 99515, United...",ChIJMdQzoAOZyFYR1rEIFO_2Wyo,/biz/yakishabu-sushi-house-anchorage-4?osq=Res...,0.184925,3.9,99515,39,15252,...,1,4.0,1,106755,1,0,0,32,"Offers Delivery\nOffers Takeout\nCasual, Trend...",9
61.216698,Yamaya Seafood Restaurant,-149.898625,"825 W 6th Ave, Anchorage, AK 99501, United States",ChIJVVN224C9yFYRmmjSJ1vPVj4,/biz/yamaya-seafood-restaurant-anchorage?osq=R...,0.123558,3.7,99501,58,9223,...,0,7.2,1,61509,0,1,1,124,Takes Reservations\nOffers Takeout\nNo Deliver...,15
61.184160,Yogo Delight,-149.867577,"4007 Old Seward Hwy # 200, Anchorage, AK 99503...",ChIJT0w0d7yXyFYRcCATvyPkT6Y,/biz/yogo-delight-anchorage?osq=Restaurants,0.099800,4.4,99508,9,15722,...,0,6.5,1,65430,0,1,0,116,Offers Takeout\nNo Reservations\nNo Delivery\n...,18
61.195857,Zorba's Gyros,-149.890254,"2700 Blueberry Rd, Anchorage, AK 99503, United...",ChIJI7cNe8WXyFYRuJw8-CPA5f4,/biz/zorbas-gyros-anchorage?osq=Restaurants,0.116808,4.4,99518,21,6234,...,0,3.0,0,84045,0,1,1,80,Offers Takeout\nNo Reservations\nAccepts Credi...,11
61.195468,Serrano's Mexican Grill,-149.880141,"201 E Northern Lights Blvd, Anchorage, AK 9950...",ChIJH0A8uciXyFYRQvUedUNWEEU,/biz/serranos-mexican-grill-anchorage?osq=Rest...,0.141745,3.9,99577,13,22970,...,1,3.5,1,111388,1,1,0,270,Offers Delivery\nOffers Takeout\nNo Reservatio...,20

In [414]:
# look at stats for the different classes
class_gtky = gtky.groupby("ZIP")
class_gtky.describe()

      Longitude                                                            \
          count        mean       std         min         25%         50%
ZIP
99501      56.0 -148.742000  8.439060 -149.982134 -149.896281 -149.888814
99502       6.0 -149.916733  0.045542 -149.983585 -149.943912 -149.912612
99503      94.0 -149.874413  0.058371 -149.952618 -149.904025 -149.885408
99504      10.0 -149.618327  0.699157 -149.915430 -149.890578 -149.836955
99507      23.0 -149.867175  0.043462 -149.913815 -149.893826 -149.885075
99508       9.0 -149.851966  0.054903 -149.907983 -149.890611 -149.867577
99515      39.0 -149.843831  0.090286 -149.915729 -149.893782 -149.874919
99517      15.0 -149.865809  0.090081 -149.937970 -149.915144 -149.892066
99518      21.0 -149.876652  0.074823 -149.942590 -149.897319 -149.890254
99540       4.0 -149.694135  0.216026 -149.893939 -149.874339 -149.692308
99577      14.0 -147.550504  8.720974 -149.982857 -149.892293 -149.873930

                              AverageExposure            ... Reviews          \
              75%         max           count      mean  ...     75%     max
ZIP                                                      ...
99501 -149.872529  -86.719709            56.0  0.153591  ...  230.25  2480.0
99502 -149.882729 -149.864476             6.0  0.115208  ...   70.00   155.0
99503 -149.868873 -149.563550            94.0  0.133839  ...  162.75  2967.0
99504 -149.766768 -147.636225            10.0  0.122940  ...  126.50   414.0
99507 -149.857953 -149.741059            23.0  0.105630  ...  198.00   426.0
99508 -149.839750 -149.734193             9.0  0.118777  ...  167.00   226.0
99515 -149.836392 -149.568249            39.0  0.110079  ...  135.50   607.0
99517 -149.861268 -149.570695            15.0  0.128230  ...  160.00   486.0
99518 -149.867133 -149.569488            21.0  0.121858  ...  141.00   358.0
99540 -149.512104 -149.497986             4.0  0.203595  ...   84.75   102.0
99577 -149.843747 -117.250918            14.0  0.103617  ...  190.00   270.0

      Amenity_Count
              count       mean       std   min    25%   50%    75%   max
ZIP
99501          56.0   8.285714  7.300596   2.0   3.00   4.0  14.25  27.0
99502           6.0  14.333333  3.983298  11.0  11.25  13.0  16.25  21.0
99503          94.0  13.361702  7.029662   0.0   9.00  14.0  17.00  31.0
99504          10.0  12.900000  7.125073   2.0   7.25  13.5  16.75  25.0
99507          23.0   6.434783  7.011848   0.0   2.00   4.0   8.50  23.0
99508           9.0  17.444444  6.710274   3.0  17.00  18.0  19.00  29.0
99515          39.0  12.435897  6.443254   0.0   8.00  14.0  16.00  32.0
99517          15.0  13.466667  5.755329   3.0  10.00  14.0  17.50  24.0
99518          21.0  15.380952  5.074211   5.0  12.00  16.0  19.00  27.0
99540           4.0  16.000000  4.320494  10.0  14.50  17.0  18.50  20.0
99577          14.0  14.500000  6.560371   2.0  11.50  15.5  18.75  25.0

[11 rows x 248 columns]

## Saving a DataFrame as a csv
- .to_csv()
- index=False
- header=False
- appending to csv (mode='a', header=None)

In [415]:
# doesn't save index into first column of csv
gtky.to_csv('gtky_copy.csv', index=False)

In [416]:
# doesn't save header into first row of csv
gtky.to_csv('gtky_copy_no_head.csv', header=False)

In [417]:
# why would you want to not save the header?
# you could append to an existing csv with mode = 'a'

gtky.to_csv('gtky_copy2.csv', index=False)
for _ in range(10):
    gtky.to_csv('gtky_copy2.csv', header=False, mode='a')

## What's next?

The example above seems a bit contrived, but imagine you have a web-scraping job which goes to some web page every hour and scrapes it to get some new data.  You could just add the new data as a few new rows to your existing dataset with the syntax shown above.

Next Topics (for Homework 2):
- Getting Data from the internet (APIs and Web Scraping)
- Cleaning Data
- Summarizing data with numerical summaries and plots